### Series객체

In [1]:
import pandas as pd
import numpy as np

m2 = pd.read_csv('employee.csv')
m2

  ename deptname addr          phone
0   kim      관리직  서울시  010-1111-1111
1  park      관리직  부산시  010-2222-2222
2   lee      영업직  광주시  010-3333-3333
3   min      영업직  광주시  010-4444-4444
4  song      개발직  광주시  010-5555-5555

In [2]:
# 컬럼접근
sr = m2['ename']   # Series 객체
sr

0     kim
1    park
2     lee
3     min
4    song
Name: ename, dtype: object

In [17]:
# str.contains() 메서드를 사용하여 문자열의 조건 검색, 행을 추출
sr = m2['ename'].str.contains('k') # 'ename'컬럼의 데이터가 문자'k'를 포함하고 
                                   # 있는가? True/False값의 Series 객체로 반환
print(sr)    
print(type(sr)) # Series
m2[sr]     #  m2[[True,True,False,False,False]]

0     True
1     True
2    False
3    False
4    False
Name: ename, dtype: bool
<class 'pandas.core.series.Series'>

  ename deptname addr          phone
0   kim      관리직  서울시  010-1111-1111
1  park      관리직  부산시  010-2222-2222

In [13]:
# 'deptname' 이 '영업직'인 행만 추출
m2[m2['deptname'].str.contains('영업직')]

  ename deptname addr          phone
2   lee      영업직  광주시  010-3333-3333
3   min      영업직  광주시  010-4444-4444

In [14]:
# 'addr' 가 '광주시'인 행만 추출
m2[m2['addr'].str.contains('광주시')]

  ename deptname addr          phone
2   lee      영업직  광주시  010-3333-3333
3   min      영업직  광주시  010-4444-4444
4  song      개발직  광주시  010-5555-5555

In [15]:
# 조건식 2개 사용
# 'deptname' 이 '영업직'이고 'addr' 가 '광주시'인 행만 추출
m2[m2['deptname'].str.contains('영업직') & m2['addr'].str.contains('광주시')]

  ename deptname addr          phone
2   lee      영업직  광주시  010-3333-3333
3   min      영업직  광주시  010-4444-4444

### Series 객체의 통계 메서드

In [29]:
score_table = { '영어': [10,20,30,40,50],
                '수학': [70,80,90,30,20]}
df = pd.DataFrame(score_table)
sr = df['영어']  # Series 객체
sr.sum()
sr.max()
sr.min()
sr.mean()
sr.median()
sr.std()
sr.var()
sr.count()
sr.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
Name: 영어, dtype: float64

### 누락된 데이터(결측치,NaN,NaT) 다루기

In [34]:
df = pd.read_csv('WHO_first9cols.csv')
len(df) - df.count()  # 결측치의 갯수:전체데이터수 - 결측치를 제외한 데이터의 갯수

df2 = df[['Country',df.columns[-2]]]
df2

                Country  Net primary school enrolment ratio male (%)
0           Afghanistan                                          NaN
1               Albania                                         94.0
2               Algeria                                         96.0
3               Andorra                                         83.0
4                Angola                                         51.0
..                  ...                                          ...
197             Vietnam                                         96.0
198  West Bank and Gaza                                          NaN
199               Yemen                                         85.0
200              Zambia                                         90.0
201            Zimbabwe                                         87.0

[202 rows x 2 columns]